# UnsatisfiedSupportAssocProp Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..UnsatisfiedSupportAssocProp Property
BuiltInFailures..::..SketchFailures Class See Also
---
Constraint between a Line created with Pick Support and the Support is not satisfied.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnsatisfiedSupportAssocProp { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnsatisfiedSupportAssocProp As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnsatisfiedSupportAssocProp {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace